examples/dfHighSpeedFoam/twoD_detonationH2/constant/CanteraTorchProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      chemistryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


chemistry           on;
CanteraMechanismFile "H2_Ja.xml";
transportModel "UnityLewis";
loadbalancing
{
        active  true;
        log   true;
}
odeCoeffs
{}
inertSpecie        "N2";

zeroDReactor
{
    //cvorcp "UV";
}
// ************************************************************************* //
