examples/dfHighSpeedFoam/twoD_detonationH2/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh   dfDynamicRefineFvMesh;

multiCritRefinementControls
{
    enableMultiCritRefinementControl  false;
}

dfDynamicRefineFvMeshCoeffs
{
    // How often to refine
    refineInterval  1; 

    // Field to be refinement on
    field           normalisedGradrho;

    // Refine field in between lower..upper
    lowerRefineLevel 0.0005;
    upperRefineLevel 1;

    // If value < unrefineLevel unrefine
    unrefineLevel   0.0005;

    // Have slower than 2:1 refinement
    nBufferLayers   3;

    // Refine cells only up to maxRefinement levels
    maxRefinement   2;

    // Stop refinement if maxCells reached
    maxCells        100000000;

    // Flux field and corresponding velocity field. Fluxes on changed
    // faces get recalculated by interpolating the velocity. Use 'none'
    // on surfaceScalarFields that do not need to be reinterpolated.
    correctFluxes
    (
        (phi none)
        (neg none)
        (pos none)
    );

    // Write the refinement level as a volScalarField
    dumpLevel       true;
}


// ************************************************************************* //